/********************************************************************************
## 문제
2차원 평면에서 직사각형과 임의의 선분이 주어지면 교점의 개수를 구하여라. 직사각형은 x, y축에 대해 평행하다.
어떤 사각형과 선분의 교점은 다음과 같이 0개, 1개, 2개, 혹은 무한 개일 수 있다.

(a) 교점이 0개인 경우
(b) 교점이 1개인 경우
(c) 교점이 2개인 경우
(d) 교점이 무한히 많은 경우

## 입력
입력의 첫 줄에 테스트케이스의 개수 T가 주어진다. 각 테스트케이스는 두개의 줄로 이루어져 있다. 첫 번째 줄엔 직사각형의 좌측 하단 좌표와 우측 상단 좌표가 각각 x, y순서로 주어진다. 
두 번째 줄엔 선분의 양 끝점 좌표가 각각 x, y순서로 주어진다. 직사각형의 변의 길이와 선분의 길이는 항상 0보다 크다. 또한, 좌표값의 절대값은 10000을 넘지 않는다.

## 출력
각 테스트케이스마다 교차점의 개수를 출력한다. 만약 교차점이 무한한 경우 4를 출력한다.

## 예제 입력

16
0 0 8 4
2 6 -2 3
0 0 8 4
0 4 9 4
0 0 8 4
3 5 6 6
0 0 8 4
-2 5 10 -1
0 0 8 4
0 5 8 5
0 0 8 4
4 3 4 1
0 0 8 4
-2 3 2 5
0 0 8 4
2 4 6 4
0 0 8 4
0 4 4 7
0 0 8 4
4 2 4 4
0 0 8 4
4 2 8 4
0 0 8 4
0 2 3 4
0 0 8 4
-4 0 12 4
0 0 8 4
4 8 4 -1
0 0 8 4
0 -2 0 6
0 0 8 4
3 4 10 4

## 예제 출력

0
4
0
2
0
0
1
4
1
1
1
2
2
2
4
4
********************************************************************************/


#include <stdio.h>
#include <stdlib.h>
#include <string.h>

int main(void){

	

	return 0;
}