/********************************************************************************
문제
두 문자열 A, B가 주어졌을때, 문자열 A에서 문자열 B가 나타나는 횟수와 그 위치를 알아내는 프로그램을 작성하시오.

입력
첫 번째 줄에 문자열 A가 주어진다.

두 번재 줄에 문자열 B가 주어진다.

문자열 내에 공백이 포함되어 있는 경우는 없고, 각 문자열의 길이는 1,000,000 이하이다.

출력
첫 번째 줄에 문자열 A에서 문자열 B가 나타나는 횟수를 출력한다.

두 번째 줄에 문자열 A에서 문자열 B가 나타나는 시작 위치를 각각 공백으로 분리하여, 오름차순으로 출력한다.

예를 들어, 문자열 A의 i번 문자부터 (i+m-1)번 문자까지가 문자열 B가 일치한다면 i를 출력하는 것이다.

힌트
예제 입력 1

ABAABCCA
AA
예제 출력 1

1
3
예제 입력 2

AAAA
AA
예제 출력 2

3
1 2 3
********************************************************************************/


#include <stdio.h>

int main(void){

	

	return 0;
}