/********************************************************************************
## 문제
지영이의 꿈은 독재자다. 독재를 하기 위해서는 권력에 반항하지 못하게 국민들의 저항을 막는 것이 중요하기 때문에, 출판물의 검열은 꼭 필요한 일이다.
지영이의 친구인 당신은 지영이를 도와 문자열을 검열하는 일을 도와주기로 했다.
정확한 검열 방식은 다음과 같다.
문자열 S에서 패턴 T가 존재하는지 검색한다.
패턴 T가 존재한다면, 그 패턴이 최초로 발생하는 위치를 삭제한다.
패턴이 존재하지 않을 때까지 작업을 반복한다.

## 입력
첫 줄에 문자열 S가 주어진다. S의 길이는 최대 1,000,000이다.
다음 줄에는 검열할 패턴 T가 주어진다. T의 길이는 S의 길이 이하이다.
S와 T는 모두 알파벳 소문자로만 이루어진다.

## 출력
문제에서 설명한 검열 방식으로 문자열에서 패턴 T를 삭제한 문자열을 출력한다.

## 입력 예시

whatthemomooofun
moo

## 출력 예시

whatthefun
********************************************************************************/


#include <stdio.h>

int main(void){

	

	return 0;
}